{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "Can I take data 602 in my first se,ester"}, {"type": "ai", "content": "If you are familiar with data analysis and machine learning or if you have an undergraduate degree in Computer Science or Information Systems, you can take DATA 602 concurrently with DATA 601 in your first semester. However, if it is not the case, then it is recommended to take DATA 602 after completing DATA 601."}, {"type": "human", "content": "Can I take data 602 in my first semester"}, {"type": "ai", "content": "Yes, it is recommended to take DATA 602 after completing DATA 601 if you are not familiar with data analysis and machine learning or do not have an undergraduate degree in Computer Science or Information Systems. Taking DATA 601 first will provide you with the foundational knowledge necessary to succeed in DATA 602."}, {"type": "human", "content": "Can I take data 602 in my first semester"}, {"type": "ai", "content": "Yes, it is recommended to take DATA 602 after completing DATA 601 if you are not familiar with data analysis and machine learning or do not have an undergraduate degree in Computer Science or Information Systems. Taking DATA 601 first will provide you with the foundational knowledge necessary to succeed in DATA 602."}, {"type": "human", "content": "Can I take data 602 in my first semester"}, {"type": "ai", "content": "Yes, it is recommended to take DATA 602 after completing DATA 601 if you are not familiar with data analysis and machine learning or do not have an undergraduate degree in Computer Science or Information Systems. Taking DATA 601 first will provide you with the foundational knowledge necessary to succeed in DATA 602."}], "feedback": "positive"}
{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "What is the syllabus of data 602"}, {"type": "ai", "content": "| Week | Topic Description |\n|------|-------------------|\n| 1    | Introduction to machine learning concepts |\n| 2    | Supervised vs. unsupervised learning |\n| 3    | Decision trees and logistic regression |\n| 4    | Linear discriminant analysis |\n| 5    | Linear and non-linear regression |\n| 6    | Support vector machines |\n| 7    | Dimensionality reduction and cross validation |\n| 8    | Bagging, Boosting, Ensemble Methods, Random Forests |\n| 9    | Experiment Design, Model Selection, Productizing Models |\n| 10   | Unsupervised learning: agglomerative, divisive, k-means, DBSCAN |\n| 11   | Dimensionality reduction and visualization in PCA |\n| 12   | Bayesian Networks |\n| 13   | Introduction to Neural Networks and Deep Learning |\n| 14   | Introduction to Reinforcement Learning |\n| 15   | Final Exam and Project presentations |"}], "feedback": "positive"}
{"intent": "Get_CPT_OPT_info", "chat_history": [], "feedback": null}
{"intent": "Get_Research_info", "chat_history": [], "feedback": "positive"}
{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "Tell me more about Policy analysis pathway"}, {"type": "ai", "content": "The Policy Analysis pathway focuses on developing skills in data science for use in complex public policy organizations. It involves research and the use of public records in public policy, which are becoming increasingly intertwined. The pathway courses focus on analytical skills, organizations using data, how data analytics are utilized, the contexts of data production and analytics, and the regulation of data production and use. \n\nSome of the courses within the Policy Analysis pathway include:\n1. ECON 600: Policy Consequences of Economic Analysis\n2. PUBL 601: Political and Social Context of the Policymaking Process\n3. PUBL 603: Theory and Practice of Policy Analysis\n4. PUBL 607: Statistical Applications in Evaluation Research\n\nStudents are recommended to choose a pathway and take three courses from the same pathway. However, in case of class unavailability, students are welcome to choose courses from different pathways. Additionally, there are DATA 690 Special Topics classes available for students who meet the prerequisites."}, {"type": "human", "content": "What are different data 690 pathways"}, {"type": "ai", "content": "The DATA 690 Special Topics courses offer various pathways for students to explore different topics in data science. Some of the pathways available include Statistical Analysis & Visualization with Python, Mathematical Foundations for Machine Learning, Data Structures and Algorithms in Python, Designing Data Driven Web Applications, Financial Data Science, and Modern Practical Deep Learning. Each pathway focuses on specific areas of data science and provides students with hands-on experience in those domains. Students can choose to take multiple Special Topics courses from different pathways, as long as the topics are different for each course to count towards their degree."}, {"type": "human", "content": "What is the syllabus for data 690 financial data"}, {"type": "ai", "content": "| Week | Topic Description |\n|------|-------------------|\n| 1    | Introduction to Financial Data Analysis |\n| 2    | Data Collection and Cleaning |\n| 3    | Financial Modeling |\n| 4    | Time Series Analysis |\n| 5    | Risk Management |\n| 6    | Portfolio Optimization |\n| 7    | Midterm Exam |\n| 8    | Machine Learning in Finance |\n| 9    | Sentiment Analysis |\n| 10   | Algorithmic Trading |\n| 11   | Blockchain and Cryptocurrency |\n| 12   | Financial Regulation and Compliance |\n| 13   | Ethical Considerations in Financial Data |\n| 14   | Final Project Presentation |"}, {"type": "human", "content": "What are the course objectives for data 602"}, {"type": "ai", "content": "The course objectives for DATA 602 include gaining proficiency in analyzing large datasets using modern tools and becoming familiar with using the public domain big data tooling pipeline such as Hadoop and its ecosystem (HBase, Hive, Pig, Spark). This course introduces methods, technologies, and computing platforms for performing data analysis at scale, covering topics such as data acquisition, cleansing, aggregation, management of large heterogeneous data collections, and information extraction. Students will also learn map-reduce, streaming, and external memory algorithms and their implementations. The goal is to provide practical experience in analyzing large existing databases."}], "feedback": "negative"}
{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "I am asking about data 602"}, {"type": "ai", "content": "If you are familiar with data analysis and machine learning or if you have an undergraduate degree in Computer Science or Information Systems, you can take DATA 602 concurrently with DATA 601. However, if that is not the case, it is recommended to take DATA 602 after completing DATA 601. Additionally, DATA 602 is a prerequisite for advanced data science courses, so you cannot take those courses before completing DATA 602."}, {"type": "human", "content": "What can I learn if take data 602 course"}, {"type": "ai", "content": "By taking the DATA 602 course, you can learn advanced topics in data analysis and machine learning. This course will provide you with the knowledge and skills to work with big data platforms, implement advanced machine learning algorithms, and analyze complex datasets. Additionally, DATA 602 is a prerequisite for advanced data science courses, so completing this course will open up opportunities to further specialize in data science."}, {"type": "human", "content": "What can I learn if I take data 603"}, {"type": "ai", "content": "By taking the DATA 603 course, you can learn advanced topics in big data platforms and technologies. This course will provide you with the knowledge and skills to work with large-scale datasets, understand distributed computing frameworks like Hadoop and Spark, and implement data processing pipelines. Additionally, DATA 603 is a prerequisite for advanced data science courses, so completing this course will open up opportunities to further specialize in big data analytics."}, {"type": "human", "content": "For which data 690 courses data 602 is prerequisite"}, {"type": "ai", "content": "DATA 602 is a prerequisite for advanced data science courses such as Modern Practical Deep Learning, Intro to NLP, and AI for Practitioners. You cannot take these courses before completing DATA 602."}], "feedback": "negative"}
{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "what are different offerings in Data 690?"}, {"type": "ai", "content": "In the Data 690 course offerings, you can choose from a variety of special topics such as Statistical Analysis & Visualization with Python, Mathematical Foundations for Machine Learning, Data Structures and Algorithms in Python, Financial Data Science, Introduction to Natural Language Processing, Artificial Intelligence for Practitioners, Modern Practical Deep Learning, and Designing Data Driven Web Applications. These courses are designed to cater to different skill levels and interests in the field of data science. It is recommended to take Data 690 Special Topics: Statistical Analysis & Visualization with Python if you have minimal python programming experience. Additionally, there is a course on Mathematical Foundations for Machine Learning that focuses on refreshing knowledge in Linear Algebra. Remember that all DATA 690 courses count towards your degree requirements."}, {"type": "human", "content": "what is the syllabus for Data 690?"}, {"type": "ai", "content": "| Week | Topic Description |\n|------|-------------------|\n| 1    | Introduction. What is AI? History of AI and Evolution of Machines. Class Survey |\n| 2    | AI Hardware Fundamentals |\n| 3    | AI Software Fundamentals |\n| 4    | Knowledge Representation  Reasoning |\n| 5    | Search, Pathfinding and Association |\n| 6    | Rules based, workflows and Robotic Process Automation |\n| 7    | Midterm Exam |\n| 8    | Agent Architectures and Multi-Agent Systems |\n| 9    | Learning to Act |\n| 10   | Machine Learning and NLP |\n| 11   | Computer Vision |\n| 12   | AI in the Cloud, Edge  Embedded Computing |\n| 13   | Ethics  Security |\n| 14   | Robotics  Final Lab |"}, {"type": "human", "content": "what is the syllabus for Data 690?"}, {"type": "ai", "content": "| Week | Topic Description |\n|------|-------------------|\n| 1    | Introduction to AI, History of AI and Evolution of Machines, Class Survey |\n| 2    | AI Hardware Fundamentals |\n| 3    | AI Software Fundamentals |\n| 4    | Knowledge Representation and Reasoning |\n| 5    | Search, Pathfinding, and Association |\n| 6    | Rules based, workflows, and Robotic Process Automation |\n| 7    | Midterm Exam |\n| 8    | Agent Architectures and Multi-Agent Systems |\n| 9    | Learning to Act |\n| 10   | Machine Learning and NLP |\n| 11   | Computer Vision |\n| 12   | AI in the Cloud, Edge, and Embedded Computing |\n| 13   | Ethics and Security |\n| 14   | Robotics and Final Lab |"}, {"type": "human", "content": "what is the syllabus for Data 690 finance?"}, {"type": "ai", "content": "| Week | Topic Description |\n|------|-------------------|\n| 1    | Introduction to Finance and Financial Markets |\n| 2    | Time Value of Money |\n| 3    | Risk and Return |\n| 4    | Financial Statement Analysis |\n| 5    | Corporate Finance |\n| 6    | Valuation Methods |\n| 7    | Capital Budgeting |\n| 8    | Stock and Bond Valuation |\n| 9    | Portfolio Management |\n| 10   | Options and Futures |\n| 11   | International Finance |\n| 12   | Financial Modeling |\n| 13   | Risk Management |\n| 14   | Final Project Presentation |\n| 15   | Final Exam |"}], "feedback": "positive"}
{"intent": "Get_Course_info", "chat_history": [], "feedback": "positive"}
{"intent": "Get_General_info", "chat_history": [{"type": "human", "content": "I'm asking for grader positions?"}, {"type": "ai", "content": "I couldn't find information regarding grader positions in the context provided. Could you please provide more details or clarify your question further? If you have any specific terms or topics related to grader positions, feel free to include them to help narrow down the search."}, {"type": "human", "content": "how can I get grader position?"}, {"type": "ai", "content": "I couldn't find information regarding grader positions in the context provided. Could you please provide more details or clarify your question further? If you have any specific terms or topics related to grader positions, feel free to include them to help narrow down the search."}, {"type": "human", "content": "how can I get grader positions in data science"}, {"type": "ai", "content": "I couldn't find information regarding grader positions in the context provided. Could you please provide more details or clarify your question further? If you have any specific terms or topics related to grader positions, feel free to include them to help narrow down the search."}, {"type": "human", "content": "how can I get GGT position in data science"}, {"type": "ai", "content": "To obtain a Graduate Grader/Tutor (GGT) position in data science, you need to complete the required courses (DATA 601, 602, 603, and 604), meet the eligibility criteria (such as having an undergraduate degree, GPA of 3.0 or higher, competency in Calculus, Statistics, and basic programming), and formally apply through the provided link with the necessary documents (resume, transcript). Additionally, ensure you are not a new student, not planning an internship next semester, and not in your final semester with only one class. The final selection for fall semester is made in August and for the spring semester in January. If you have any specific questions or need further assistance, feel free to ask."}], "feedback": "positive"}
{"intent": "Get_General_info", "chat_history": [{"type": "human", "content": "topics related to GGT positions in data science"}, {"type": "ai", "content": "I couldn't find a direct answer in the provided information. Could you provide more details or rephrase your question? You might also consider specifying terms or topics related to GGT positions in data science to help refine the search."}, {"type": "human", "content": "how to get CPT?"}, {"type": "ai", "content": "Student: How can I obtain a CPT?\nAssistant: Based on the context provided, to obtain a Curricular Practical Training (CPT), you need to log in to your ISSS Portal, click on \"Search Forms,\" select the CPT request, complete all sections of the application, upload the email confirmation of your enrollment in the Internship Success Practicum (PRAC), ensure the work is related to your academic program, get approval from your academic advisor and Graduate Program Director (for graduate students), and only click submit after uploading all requirements. Make sure to follow the guidelines and deadlines outlined in the CPT application process."}], "feedback": "positive"}
{"intent": "Get_CPT_OPT_info", "chat_history": [], "feedback": "positive"}
{"intent": "Feedback", "chat_history": [], "feedback": "positive"}
{"intent": "Get_Research_info", "chat_history": [], "feedback": "positive"}
{"intent": "Get_General_info", "chat_history": [{"type": "human", "content": "how can i contact professor manas Gaur"}, {"type": "ai", "content": "I couldn't find information about contacting Professor Manas Gaur in the provided context. Could you please provide more details or rephrase your question? If you're looking for contact information for a specific professor, you may need to reach out to the program coordinators or check the university directory for their contact details."}, {"type": "human", "content": "I am looking for contact details of Manas Gaur from Kai2 lab"}, {"type": "ai", "content": "I couldn't find information about Manas Gaur from the Kai2 lab in the provided context. Could you please provide more details or rephrase your question? If you're looking for contact information for a specific individual at UMBC, it might be helpful to reach out to the program coordinators or check the university directory for their contact details."}], "feedback": "positive"}
{"intent": "Get_Research_info", "chat_history": [], "feedback": "positive"}
{"intent": "Get_General_info", "chat_history": [], "feedback": "positive"}
{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "What about data 613 course"}, {"type": "ai", "content": "The DATA 613 course, Data Visualization and Communication, will be starting from Fall 2025. This course is not offered every semester, so it is important to plan accordingly. It is one of the foundational data science courses and will provide students with skills in visualizing and communicating data effectively. If you are interested in this course, make sure to check the course schedule and prerequisites before planning to take it."}, {"type": "human", "content": "Are there any prerequisites for this course"}, {"type": "ai", "content": "The prerequisites for the DATA 613 course, Data Visualization and Communication, include the completion of DATA 601, 602, 603, 604, and 605. It is important to have a strong foundation in data science before taking this course. If you are interested in enrolling in DATA 613, make sure you have completed these prerequisite courses."}], "feedback": "positive"}
{"intent": "Get_Course_info", "chat_history": [], "feedback": "positive"}
{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "what about course data 621"}, {"type": "ai", "content": "DATA 621, Practical Deep Learning, is an advanced data science course that focuses on deep learning techniques. It is recommended to take this course after completing DATA 602. Please note that DATA 602 is a prerequisite for advanced data science courses, including DATA 621. Therefore, you cannot take DATA 621 before completing DATA 602. Additionally, DATA 621 is scheduled to start from the Spring 2025 semester. If you are interested in deep learning and want to explore advanced techniques in this field, DATA 621 may be a suitable course for you to consider in your graduate study."}, {"type": "human", "content": "what is difference between data 621 and data 690 deep learning"}, {"type": "ai", "content": "DATA 621, Practical Deep Learning, is an advanced data science course that focuses on deep learning techniques. It is scheduled to start from the Spring 2025 semester and is designed for students who have a strong foundation in data science. On the other hand, DATA 690 Special Topics: Modern Practical Deep Learning is a special topics course that covers modern and practical applications of deep learning. It is one of the advanced data science courses offered in the program. Please note that DATA 602 is a prerequisite for advanced data science courses, including DATA 621 and DATA 690. Therefore, you cannot take these courses before completing DATA 602. If you are interested in exploring deep learning techniques further, both DATA 621 and DATA 690 Deep Learning courses can be valuable additions to your graduate study."}, {"type": "human", "content": "What are the offerings of both these courses"}, {"type": "ai", "content": "DATA 621, Practical Deep Learning, is an advanced data science course that focuses on deep learning techniques. It is recommended to take this course after completing DATA 602. Please note that DATA 602 is a prerequisite for advanced data science courses, including DATA 621. Therefore, you cannot take DATA 621 before completing DATA 602. Additionally, DATA 621 is scheduled to start from the Spring 2025 semester.\n\nOn the other hand, DATA 690 Special Topics: Modern Practical Deep Learning is a special topics course that covers modern and practical applications of deep learning. It is one of the advanced data science courses offered in the program. Please note that DATA 602 is a prerequisite for advanced data science courses, including DATA 690. Therefore, you cannot take this course before completing DATA 602. If you are interested in exploring deep learning techniques further, both DATA 621 and DATA 690 Deep Learning courses can be valuable additions to your graduate study."}], "feedback": "positive"}
{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "what is the syllabus for data 690 deep learning"}, {"type": "ai", "content": "| Week | Topic Description |\n|------|-------------------|\n| 1    | Introduction to Deep Learning, Neural Networks, and Artificial Neural Networks |\n| 2    | Fundamentals of Deep Learning, Activation Functions, and Loss Functions |\n| 3    | Gradient Descent, Backpropagation, and Optimizers in Deep Learning |\n| 4    | Convolutional Neural Networks (CNNs) and Image Recognition |\n| 5    | Recurrent Neural Networks (RNNs) and Sequence Processing |\n| 6    | Generative Adversarial Networks (GANs) and Unsupervised Learning |\n| 7    | Midterm Exam |\n| 8    | Transfer Learning and Fine-Tuning |\n| 9    | Reinforcement Learning and Deep Q-Learning |\n| 10   | Natural Language Processing (NLP) and Deep Learning |\n| 11   | Advanced Topics in Deep Learning: Attention Mechanisms, Transformers |\n| 12   | Deep Learning in Production: Deployment and Scalability |\n| 13   | Ethical Considerations in Deep Learning |\n| 14   | Final Project Presentation and Evaluation |"}], "feedback": "negative"}
{"intent": "Feedback", "chat_history": [{"type": "human", "content": "Thank you"}, {"type": "ai", "content": "You're welcome! If you have any questions about the login process or need assistance accessing the content, feel free to ask."}], "feedback": "positive"}
{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "What is the syllabus fr data 602"}, {"type": "ai", "content": "| Week | Topic Description                                          |\n|------|------------------------------------------------------------|\n| 1    | Introduction to machine learning concepts and basics       |\n| 2    | Supervised vs. unsupervised learning                        |\n| 3    | Decision trees and logistic regression                      |\n| 4    | Linear discriminant analysis and linear regression          |\n| 5    | Non-linear regression and support vector machines           |\n| 6    | Introduction to clustering methods                          |\n| 7    | Ensembling techniques: Bagging, Boosting, Random Forests    |\n| 8    | Experiment design and model selection decisions             |\n| 9    | Productizing models and deployment considerations           |\n| 10   | Unsupervised learning methods: agglomerative, divisive, k-means, DBSCAN |\n| 11   | Dimensionality reduction and visualization with PCA         |\n| 12   | Introduction to Bayesian Networks                           |\n| 13   | Basics of Neural Networks and Deep Learning                 |\n| 14   | Introduction to Reinforcement Learning                      |\n| 15   | Final Exam and Project Presentations                        |"}, {"type": "human", "content": "Are there any prerequisites to take this course?"}, {"type": "ai", "content": "Yes, there are prerequisites required to take the data 602 course. To meet the prerequisites, we recommend taking Math 151, Stat 355, and CMSC 201 (Python section) at UMBC. Additionally, community colleges like the Community College of Baltimore County or Montgomery College offer courses such as Math 251, Math 153, MATH 181, and MATH 117 that can help fulfill the calculus and stats prerequisites. Keep in mind that we do not accept online courses from sites like Coursera and edX to fulfill the prerequisite requirements."}], "feedback": "positive"}
{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "What is the syllabus for Data 602"}, {"type": "ai", "content": "| Week | Topic Description                                          |\n|------|------------------------------------------------------------|\n| 1    | Introduction to machine learning and data analysis        |\n| 2    | Supervised vs. unsupervised learning                       |\n| 3    | Decision trees, logistic regression                        |\n| 4    | Linear discriminant analysis, linear and non-linear regression |\n| 5    | Support vector machines                                    |\n| 6    | Introduction to neural networks and deep learning          |\n| 7    | Hypothesis space, probability, classifier                  |\n| 8    | Bagging, Boosting and Ensemble Methods, Random Forests     |\n| 9    | Experiment Design, Decisions in Model Selection, Productizing Models |\n| 10   | Unsupervised learning: agglomerative, divisive, k-means, DBSCAN |\n| 11   | Dimensionality reduction and visualization in principal component analysis |\n| 12   | Bayesian Networks                                          |\n| 13   | Introduction to Reinforcement Learning                     |\n| 14   | Final ExamProject presentations                            |\n| 15   | Details not available.                                     |"}, {"type": "human", "content": "are there any prerequisites for this course"}, {"type": "ai", "content": "The prerequisites for this course include the completion of DATA 601, 602, 603, 604, and 605. These courses provide the foundational knowledge and skills necessary for students to succeed in this course."}], "feedback": "positive"}
{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "DATA 613"}, {"type": "ai", "content": "Based on the course descriptions and prerequisites provided, it seems that DATA 613 is not mentioned in the course offerings or prerequisites. It is recommended to consult with your academic advisor or the department offering the Data Science program to inquire about the availability and requirements for DATA 613. They will be able to provide you with the most accurate and up-to-date information regarding this course."}], "feedback": "negative"}
{"intent": "Get_Course_info", "chat_history": [], "feedback": null}
{"intent": "Get_Course_info", "chat_history": [], "feedback": "positive"}
{"intent": "Get_General_info", "chat_history": [], "feedback": null}
{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "what is the syllabus for data 613"}, {"type": "ai", "content": "| Week | Topic Description |\n|------|-------------------|\n| 1    | Enhancing Audience-Centric Communication: Tailoring communication strategies to stakeholders |\n| 2    | Cultivating Ethical Data Communication Practices: Identifying and addressing ethical considerations in data storytelling |\n| 3    | Integrating Advanced Tools and Technologies: Hands-on experience with cutting-edge data visualization tools |\n| 4    | Developing Advanced Data Narrative Skills: Crafting compelling data-driven narratives |\n| 5    | Mastering Data Visualization Techniques: Creating clear and visually appealing data visualizations |\n| 6    | Enhancing Audience-Centric Communication: Presenting data insights in relevant and accessible ways |\n| 7    | Cultivating Ethical Data Communication Practices: Mitigating bias and maintaining transparency |\n| 8    | Integrating Advanced Tools and Technologies: Creating interactive dashboards and multimedia presentations |"}, {"type": "human", "content": "what is the syllabus for data 621"}, {"type": "ai", "content": "| Week | Topic Description |\n|------|-------------------|\n| 1    | Introduction to PyTorch Foundations: Automatic Differentiation, PyTorch mechanics |\n| 2    | Neural Network Review: Loss Function, Activation Functions, Regularization |\n| 3    | Convolutional Neural Networks (CNNs): Pooling, Weight Sharing, Stride, Dilation, Application: Image Classification |\n| 4    | Recurrent Neural Networks (RNNs): Sequence Prediction Problems, Gradient Clipping |\n| 5    | Network Design: Common Design Building-Blocks: Batch-Normalization, Skip-Connections, 11 Convolution |\n| 6    | Modern Training Techniques: Momentum, Hyperparameter Optimization, dropout, learning-rate annealing |\n| 7    | Network Design: Embedding Auto-Encoding: PCA, Self-Supervision, Application: Image Denoising Information Retrieval |\n| 8    | Region Proposal Networks: Mask R-CNN, Applications: Object Detection |\n| 9    | Generative Adversarial Networks (GANs): Min-Max games, Generative Models, Ethics, Applications: Photo Manipulation, Super-Resolution |\n| 10   | Network Design: Attention Mechanisms: Attention, encoding priors, Application: Machine Translation |\n| 11   | Network Design: Alternatives to RNNs: Temporal Pooling, Transformers |\n| 12   | Transfer Learning: Pre-training, Fine-tuning weight freezing, domain adaption, Application: Object Detection, NLP |\n| 13   | Network Design 2: Advanced Design Building Blocks Training Techniques: Scale-Adaption, Better Pooling, mixup |\n| 14   | Review |\n| 15   | Project Demonstrations |"}], "feedback": null}
{"intent": "Get_Research_info", "chat_history": [], "feedback": "negative"}
{"intent": "Get_Research_Faculty_info", "chat_history": [], "feedback": null}
{"intent": "Get_Research_info", "chat_history": [], "feedback": "positive"}
{"intent": "Get_Course_info", "chat_history": [], "feedback": null}
{"intent": "Get_Research_info", "chat_history": [], "feedback": null}
{"intent": "Get_CPT_OPT_info", "chat_history": [{"type": "human", "content": "is there any application fees for it"}, {"type": "ai", "content": "Yes, there is a non-refundable application fee of $50 for online applications. Additionally, for changes to F-1 status, there is an additional $350 SEVIS fee that is required. Let me know if you need more information on this!"}], "feedback": "positive"}
{"intent": "Get_CPT_OPT_Info", "chat_history": [], "feedback": "positive"}
{"intent": "Get_CPT_OPT_info", "chat_history": [], "feedback": null}
{"intent": "Get_General_info", "chat_history": [], "feedback": "positive"}
{"intent": "Get_CPT_OPT_info", "chat_history": [], "feedback": null}
{"intent": "Get_CPT_OPT_Info", "chat_history": [], "feedback": "negative"}
{"intent": "Get_General_info", "chat_history": [{"type": "human", "content": "How can I register for classes"}, {"type": "ai", "content": "I couldn't find a direct answer in the provided information. Could you provide more details or rephrase your question? You might also consider specifying terms or topics to help refine the search."}], "feedback": "positive"}
{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "What are the courses in Data Science"}, {"type": "ai", "content": "In our Data Science program, we offer a range of courses divided into different categories. \n\nFor the core Data Science courses, all master's students are required to take:\n- DATA 601 Introduction to Data Science\n- DATA 602 Introduction to Data Analysis and Machine Learning\n- DATA 603 Platforms for Big Data Processing\n- DATA 604 Data Management\n- DATA 605 Ethical Legal Issues in Data Science\n- DATA 606 Capstone Project in Data Science (ONLINE)\n- DATA 607 Leadership in Data Science\n\nCertificate students need to take DATA 601 and DATA 604 only and achieve a grade of B or better in each class.\n\nWe also have Foundational Data Science Courses, including:\n- DATA 608 Probability and Statistics for Data Science\n- DATA 613 Data Visualization and Communication (Starting from Fall 2025)\n- DATA 690 Special Topics: Statistical Analysis & Visualization with Python\n\nAdditionally, we offer Special Topics courses that cover various aspects of Data Science, such as Statistical Analysis & Visualization with Python, Mathematical Foundations for Machine Learning, Data Structures and Algorithms in Python, Financial Data Science, and more. \n\nPlease note that some courses are not offered every semester, and prerequisites may apply for certain advanced courses. Feel free to reach out if you need more specific information on any particular course."}, {"type": "human", "content": "What are the courses in Data Science"}, {"type": "ai", "content": "Sure! I can provide more specific information on any particular course in the Data Science program. Just let me know which course you are interested in, and I'll be happy to give you more details on its content, prerequisites, and any other relevant information."}, {"type": "human", "content": "How can i register for classes"}, {"type": "ai", "content": "To register for Data Science classes, you will need to set up your myUMBC account and register for orientation. Once you have completed these steps, you can proceed to register for classes through the registration system. If you have any specific questions or need assistance with the registration process, feel free to reach out to the appropriate department or program advisor for guidance."}, {"type": "human", "content": "How can i register for classes"}, {"type": "ai", "content": "To set up your myUMBC account and register for orientation to eventually enroll in Data Science classes, you will need to follow these steps:\n\n1. Go to the UMBC website and find the link to set up your myUMBC account.\n2. Create your account using the required information.\n3. Once your account is set up, log in to myUMBC and look for the information on registering for orientation.\n4. Follow the instructions provided to register for orientation.\n5. After completing orientation, you will be able to access the registration system to enroll in Data Science classes.\n\nIf you encounter any difficulties or have questions during this process, don't hesitate to reach out to the appropriate department or program advisor for assistance."}], "feedback": "negative"}
{"intent": "Get_General_info", "chat_history": [], "feedback": "positive"}
{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "What are the different 690 courses"}, {"type": "ai", "content": "The different DATA 690 courses currently offered in our program are:\n- DATA 690 Special Topics: Statistical Analysis & Visualization with Python\n- DATA 690 Special Topics: Mathematical Foundations for Machine Learning\n- DATA 690 Special Topics: Data Structures and Algorithms in Python\n- DATA 690 Special Topics: Financial Data Science\n- DATA 690 Special Topics: Introduction to Natural Language Processing\n- DATA 690 Special Topics: Artificial Intelligence for Practitioners\n- DATA 690 Special Topics: Designing Data Driven Web Applications\n- DATA 690 Special Topics: Modern Practical Deep Learning\n\nPlease note that some of these courses have prerequisites, so make sure to check the requirements before enrolling."}, {"type": "human", "content": "Are there any new courses"}, {"type": "ai", "content": "At the moment, the program is offering the following new DATA 690 Special Topics courses:\n- DATA 690 Special Topics: Statistical Analysis & Visualization with Python\n- DATA 690 Special Topics: Mathematical Foundations for Machine Learning\n- DATA 690 Special Topics: Data Structures and Algorithms in Python\n- DATA 690 Special Topics: Financial Data Science\n- DATA 690 Special Topics: Introduction to Natural Language Processing\n- DATA 690 Special Topics: Artificial Intelligence for Practitioners\n- DATA 690 Special Topics: Designing Data Driven Web Applications\n- DATA 690 Special Topics: Modern Practical Deep Learning\n\nPlease note that some of these courses have prerequisites, so make sure to check the requirements before enrolling."}, {"type": "human", "content": "What are the prerequisites for these courses"}, {"type": "ai", "content": "The prerequisites for the DATA 690 Special Topics courses currently offered in the program vary depending on the course. Here is a breakdown of the prerequisites for each course:\n\n1. DATA 690 Special Topics: Statistical Analysis & Visualization with Python - No specific prerequisites, suitable for students with minimal Python programming experience.\n\n2. DATA 690 Special Topics: Mathematical Foundations for Machine Learning - Designed to help students refresh their knowledge in Linear Algebra, no specific prerequisites mentioned.\n\n3. DATA 690 Special Topics: Data Structures and Algorithms in Python - No specific prerequisites mentioned.\n\n4. DATA 690 Special Topics: Financial Data Science - Prerequisite: DATA 601.\n\n5. DATA 690 Special Topics: Introduction to Natural Language Processing - No specific prerequisites mentioned.\n\n6. DATA 690 Special Topics: Artificial Intelligence for Practitioners - No specific prerequisites mentioned.\n\n7. DATA 690 Special Topics: Designing Data Driven Web Applications - Prerequisite: DATA 601.\n\n8. DATA 690 Special Topics: Modern Practical Deep Learning - No specific prerequisites mentioned.\n\nPlease note that these prerequisites are subject to change, so it's recommended to check the requirements before enrolling in any of the DATA 690 Special Topics courses."}, {"type": "human", "content": "What are the prerequisites for these courses"}, {"type": "ai", "content": "The prerequisites for the DATA 690 Special Topics courses currently offered in the program vary depending on the course. Here is a breakdown of the prerequisites for each course:\n\n1. DATA 690 Special Topics: Statistical Analysis & Visualization with Python - No specific prerequisites, suitable for students with minimal Python programming experience.\n\n2. DATA 690 Special Topics: Mathematical Foundations for Machine Learning - Designed to help students refresh their knowledge in Linear Algebra, no specific prerequisites mentioned.\n\n3. DATA 690 Special Topics: Data Structures and Algorithms in Python - No specific prerequisites mentioned.\n\n4. DATA 690 Special Topics: Financial Data Science - Prerequisite: DATA 601.\n\n5. DATA 690 Special Topics: Introduction to Natural Language Processing - No specific prerequisites mentioned.\n\n6. DATA 690 Special Topics: Artificial Intelligence for Practitioners - No specific prerequisites mentioned.\n\n7. DATA 690 Special Topics: Designing Data Driven Web Applications - Prerequisite: DATA 601.\n\n8. DATA 690 Special Topics: Modern Practical Deep Learning - No specific prerequisites mentioned.\n\nPlease note that these prerequisites are subject to change, so it's recommended to check the requirements before enrolling in any of the DATA 690 Special Topics courses."}], "feedback": "positive"}
{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "\"What are the prerequisites for this course"}, {"type": "ai", "content": "The prerequisites for this course are enrollment in the Data Science Program. Other students may be admitted with instructor permission."}, {"type": "human", "content": "What are the course learning objectives of data 690 deep learning"}, {"type": "ai", "content": "The course learning objectives of DATA 690 Deep Learning include introducing students to the basic concepts and techniques of modern neural networks, developing skills in using recent deep learning methods and tools for solving practical problems, teaching how to design neural networks for domain-specific applications, and informing students about open issues in deep learning."}, {"type": "human", "content": "What are the prerequisites for this course"}, {"type": "ai", "content": "The prerequisites for the DATA 690 Deep Learning course are enrollment in the Data Science Program. Other students may be admitted with instructor permission."}, {"type": "human", "content": "What are the course learning objectives of data 690 deep learning"}, {"type": "ai", "content": "The course learning objectives of DATA 690 Deep Learning include introducing students to the basic concepts and techniques of modern neural networks, developing skills in using recent deep learning methods and tools for solving practical problems, teaching how to design neural networks for domain-specific applications, and informing students about open issues in deep learning."}], "feedback": "positive"}
{"intent": "Get_CPT_OPT_info", "chat_history": [], "feedback": "positive"}
{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "What are the course learning objectives of data 690 deep learning"}, {"type": "ai", "content": "The course learning objectives of DATA 690 Special Topics: Modern Practical Deep Learning are to introduce students to the basic concepts and techniques of modern neural networks, develop skills in using recent deep learning methods and tools for solving practical problems, teach how to design neural networks for domain-specific applications, and inform students about open issues in deep learning."}, {"type": "human", "content": "What are the course learning objectives of data 690 deep learning"}, {"type": "ai", "content": "The course learning objectives of DATA 690 Special Topics: Modern Practical Deep Learning are to introduce students to the basic concepts and techniques of modern neural networks, develop skills in using recent deep learning methods and tools for solving practical problems, teach how to design neural networks for domain-specific applications, and inform students about open issues in deep learning."}, {"type": "human", "content": "What are the course learning objectives of data 690 deep learning"}, {"type": "ai", "content": "The course learning objectives of DATA 690 Special Topics: Modern Practical Deep Learning are to introduce students to the basic concepts and techniques of modern neural networks, develop skills in using recent deep learning methods and tools for solving practical problems, teach how to design neural networks for domain-specific applications, and inform students about open issues in deep learning."}, {"type": "human", "content": "Can I take this course without taking data 602"}, {"type": "ai", "content": "No, you cannot take the DATA 690 Special Topics: Modern Practical Deep Learning course without having taken DATA 602. DATA 602 is a prerequisite for advanced data science courses like DATA 690 Special Topics, so you must complete DATA 602 before enrolling in the Deep Learning course."}], "feedback": "positive"}
{"intent": "Get_CPT_OPT_info", "chat_history": [], "feedback": "negative"}
{"intent": "Get_General_info", "chat_history": [], "feedback": "negative"}
{"intent": "Get_CPT_OPT_info", "chat_history": [], "feedback": "negative"}
{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "what courses should I take in first sem?"}, {"type": "ai", "content": "Based on the information provided, if you don't have serious programming experience, it is recommended to take Data 690 Special Topics: Statistical Analysis and Visualization with Python (Stats and Viz) in your first semester. This course is designed for students with minimal Python programming experience. Another course you might consider in your first semester is either DATA 605 or DATA 607. If you are an international student, it is recommended to take both Data 605 and DATA 607.\n\nAdditionally, there is another course called DATA 690 Special Topics: Mathematical Foundations for Machine Learning, which is designed to help students who need to refresh their knowledge in Linear Algebra. This course covers basic matrix operations in Python, vector calculus, analytic geometry, matrix decompositions, and optimization. Keep in mind that this course may not be offered every semester.\n\nIt's important to note that all DATA 690 courses count towards your degree. Be sure to check for any prerequisites or recommendations in the course registration system before making your decision. If you have any specific questions or concerns about course selection, you can refer to the Graduate Catalog for more information on graduate courses and their prerequisites."}, {"type": "human", "content": "what courses should I take in first sem?"}, {"type": "ai", "content": "Based on the information provided, if you don't have serious programming experience, it is recommended to take Data 690 Special Topics: Statistical Analysis and Visualization with Python (Stats and Viz) in your first semester. This course is designed for students with minimal Python programming experience. Another course you might consider in your first semester is either DATA 605 or DATA 607. If you are an international student, it is recommended to take both Data 605 and DATA 607."}, {"type": "human", "content": "I'm a new student in Data Science what courses should I take in first semester?"}, {"type": "ai", "content": "For new students in Data Science who are not familiar with serious programming experience, it is recommended to take Data 690 Special Topics: Statistical Analysis and Visualization with Python (Stats and Viz) in their first semester. This course is designed for students with minimal Python programming experience. Another course they might consider in their first semester is either DATA 605 or DATA 607. If they are international students, it is recommended to take both Data 605 and DATA 607. \n\nIt's important to note that all DATA 690 courses count towards their degree. Be sure to check for any prerequisites or recommendations in the course registration system before making a decision. If they have any specific questions or concerns about course selection, they can refer to the Graduate Catalog for more information on graduate courses and their prerequisites."}], "feedback": "positive"}
{"intent": "Get_General_info", "chat_history": [], "feedback": "positive"}
{"intent": "Get_CPT_OPT_info", "chat_history": [], "feedback": "positive"}
{"intent": "Get_Course_info", "chat_history": [], "feedback": "positive"}
{"intent": "Get_CPT_OPT_Info", "chat_history": [], "feedback": "positive"}
{"intent": "Get_Course_info", "chat_history": [{"type": "human", "content": "what is the syllabus for Data 602?"}, {"type": "ai", "content": "| Week | Topic Description |\n|------|-------------------|\n| 1    | Introduction to machine learning and data analysis |\n| 2    | Supervised vs. unsupervised learning |\n| 3    | Decision trees and logistic regression |\n| 4    | Linear discriminant analysis |\n| 5    | Linear and non-linear regression |\n| 6    | Support vector machines |\n| 7    | Neural networks introduction |\n| 8    | Bagging, Boosting, Ensemble Methods, and Random Forests |\n| 9    | Experiment Design, Model Selection, Productizing Models |\n| 10   | Unsupervised learning: agglomerative, divisive, k-means, DBSCAN |\n| 11   | Dimensionality reduction, visualization in PCA |\n| 12   | Bayesian Networks |\n| 13   | Introduction to Neural Networks and Deep Learning |\n| 14   | Introduction to Reinforcement Learning |\n| 15   | Final Exam and Project presentations |"}, {"type": "human", "content": "any prerequisite I should take for this?"}, {"type": "ai", "content": "Yes, if you are familiar with data analysis and machine learning or if you have an undergraduate degree in Computer Science or Information Systems, you can take DATA 602 concurrently with DATA 601. However, if you do not meet these criteria, it is recommended to take DATA 602 after completing DATA 601."}], "feedback": "positive"}
